HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_bf.h
/**
 * \file IfxCan_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37x_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Can_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Can_Registers
 * 
 */
#ifndef IFXCAN_BF_H
#define IFXCAN_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Can_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_CAN_CLC_Bits.DISR */
#define IFX_CAN_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_CAN_CLC_Bits.DISR */
#define IFX_CAN_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_CAN_CLC_Bits.DISR */
#define IFX_CAN_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_CAN_CLC_Bits.DISS */
#define IFX_CAN_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_CAN_CLC_Bits.DISS */
#define IFX_CAN_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_CLC_Bits.DISS */
#define IFX_CAN_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_CAN_CLC_Bits.EDIS */
#define IFX_CAN_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_CAN_CLC_Bits.EDIS */
#define IFX_CAN_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_CLC_Bits.EDIS */
#define IFX_CAN_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_CAN_ID_Bits.MOD_REV */
#define IFX_CAN_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_CAN_ID_Bits.MOD_REV */
#define IFX_CAN_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_CAN_ID_Bits.MOD_REV */
#define IFX_CAN_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_CAN_ID_Bits.MOD_TYPE */
#define IFX_CAN_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_CAN_ID_Bits.MOD_TYPE */
#define IFX_CAN_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_CAN_ID_Bits.MOD_TYPE */
#define IFX_CAN_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_CAN_ID_Bits.MOD_NUMBER */
#define IFX_CAN_ID_MOD_NUMBER_LEN (16u)

/** \brief Mask for Ifx_CAN_ID_Bits.MOD_NUMBER */
#define IFX_CAN_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_ID_Bits.MOD_NUMBER */
#define IFX_CAN_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_CAN_MCR_Bits.CLKSEL0 */
#define IFX_CAN_MCR_CLKSEL0_LEN (2u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CLKSEL0 */
#define IFX_CAN_MCR_CLKSEL0_MSK (0x3u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CLKSEL0 */
#define IFX_CAN_MCR_CLKSEL0_OFF (0u)

/** \brief Length for Ifx_CAN_MCR_Bits.CLKSEL1 */
#define IFX_CAN_MCR_CLKSEL1_LEN (2u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CLKSEL1 */
#define IFX_CAN_MCR_CLKSEL1_MSK (0x3u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CLKSEL1 */
#define IFX_CAN_MCR_CLKSEL1_OFF (2u)

/** \brief Length for Ifx_CAN_MCR_Bits.CLKSEL2 */
#define IFX_CAN_MCR_CLKSEL2_LEN (2u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CLKSEL2 */
#define IFX_CAN_MCR_CLKSEL2_MSK (0x3u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CLKSEL2 */
#define IFX_CAN_MCR_CLKSEL2_OFF (4u)

/** \brief Length for Ifx_CAN_MCR_Bits.CLKSEL3 */
#define IFX_CAN_MCR_CLKSEL3_LEN (2u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CLKSEL3 */
#define IFX_CAN_MCR_CLKSEL3_MSK (0x3u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CLKSEL3 */
#define IFX_CAN_MCR_CLKSEL3_OFF (6u)

/** \brief Length for Ifx_CAN_MCR_Bits.NODE */
#define IFX_CAN_MCR_NODE_LEN (3u)

/** \brief Mask for Ifx_CAN_MCR_Bits.NODE */
#define IFX_CAN_MCR_NODE_MSK (0x7u)

/** \brief Offset for Ifx_CAN_MCR_Bits.NODE */
#define IFX_CAN_MCR_NODE_OFF (24u)

/** \brief Length for Ifx_CAN_MCR_Bits.DXCM */
#define IFX_CAN_MCR_DXCM_LEN (1u)

/** \brief Mask for Ifx_CAN_MCR_Bits.DXCM */
#define IFX_CAN_MCR_DXCM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MCR_Bits.DXCM */
#define IFX_CAN_MCR_DXCM_OFF (27u)

/** \brief Length for Ifx_CAN_MCR_Bits.RBUSY */
#define IFX_CAN_MCR_RBUSY_LEN (1u)

/** \brief Mask for Ifx_CAN_MCR_Bits.RBUSY */
#define IFX_CAN_MCR_RBUSY_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MCR_Bits.RBUSY */
#define IFX_CAN_MCR_RBUSY_OFF (28u)

/** \brief Length for Ifx_CAN_MCR_Bits.RINIT */
#define IFX_CAN_MCR_RINIT_LEN (1u)

/** \brief Mask for Ifx_CAN_MCR_Bits.RINIT */
#define IFX_CAN_MCR_RINIT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MCR_Bits.RINIT */
#define IFX_CAN_MCR_RINIT_OFF (29u)

/** \brief Length for Ifx_CAN_MCR_Bits.CI */
#define IFX_CAN_MCR_CI_LEN (1u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CI */
#define IFX_CAN_MCR_CI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CI */
#define IFX_CAN_MCR_CI_OFF (30u)

/** \brief Length for Ifx_CAN_MCR_Bits.CCCE */
#define IFX_CAN_MCR_CCCE_LEN (1u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CCCE */
#define IFX_CAN_MCR_CCCE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CCCE */
#define IFX_CAN_MCR_CCCE_OFF (31u)

/** \brief Length for Ifx_CAN_BUFADR_Bits.TXBUF */
#define IFX_CAN_BUFADR_TXBUF_LEN (14u)

/** \brief Mask for Ifx_CAN_BUFADR_Bits.TXBUF */
#define IFX_CAN_BUFADR_TXBUF_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_BUFADR_Bits.TXBUF */
#define IFX_CAN_BUFADR_TXBUF_OFF (0u)

/** \brief Length for Ifx_CAN_BUFADR_Bits.RXBUF */
#define IFX_CAN_BUFADR_RXBUF_LEN (14u)

/** \brief Mask for Ifx_CAN_BUFADR_Bits.RXBUF */
#define IFX_CAN_BUFADR_RXBUF_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_BUFADR_Bits.RXBUF */
#define IFX_CAN_BUFADR_RXBUF_OFF (16u)

/** \brief Length for Ifx_CAN_MECR_Bits.TH */
#define IFX_CAN_MECR_TH_LEN (16u)

