HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_bf.h
/** \brief Mask for Ifx_CAN_MECR_Bits.TH */
#define IFX_CAN_MECR_TH_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_MECR_Bits.TH */
#define IFX_CAN_MECR_TH_OFF (0u)

/** \brief Length for Ifx_CAN_MECR_Bits.INP */
#define IFX_CAN_MECR_INP_LEN (4u)

/** \brief Mask for Ifx_CAN_MECR_Bits.INP */
#define IFX_CAN_MECR_INP_MSK (0xfu)

/** \brief Offset for Ifx_CAN_MECR_Bits.INP */
#define IFX_CAN_MECR_INP_OFF (16u)

/** \brief Length for Ifx_CAN_MECR_Bits.NODE */
#define IFX_CAN_MECR_NODE_LEN (3u)

/** \brief Mask for Ifx_CAN_MECR_Bits.NODE */
#define IFX_CAN_MECR_NODE_MSK (0x7u)

/** \brief Offset for Ifx_CAN_MECR_Bits.NODE */
#define IFX_CAN_MECR_NODE_OFF (20u)

/** \brief Length for Ifx_CAN_MECR_Bits.ANYED */
#define IFX_CAN_MECR_ANYED_LEN (1u)

/** \brief Mask for Ifx_CAN_MECR_Bits.ANYED */
#define IFX_CAN_MECR_ANYED_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MECR_Bits.ANYED */
#define IFX_CAN_MECR_ANYED_OFF (24u)

/** \brief Length for Ifx_CAN_MECR_Bits.CAPEIE */
#define IFX_CAN_MECR_CAPEIE_LEN (1u)

/** \brief Mask for Ifx_CAN_MECR_Bits.CAPEIE */
#define IFX_CAN_MECR_CAPEIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MECR_Bits.CAPEIE */
#define IFX_CAN_MECR_CAPEIE_OFF (25u)

/** \brief Length for Ifx_CAN_MECR_Bits.DEPTH */
#define IFX_CAN_MECR_DEPTH_LEN (3u)

/** \brief Mask for Ifx_CAN_MECR_Bits.DEPTH */
#define IFX_CAN_MECR_DEPTH_MSK (0x7u)

/** \brief Offset for Ifx_CAN_MECR_Bits.DEPTH */
#define IFX_CAN_MECR_DEPTH_OFF (27u)

/** \brief Length for Ifx_CAN_MECR_Bits.SOF */
#define IFX_CAN_MECR_SOF_LEN (1u)

/** \brief Mask for Ifx_CAN_MECR_Bits.SOF */
#define IFX_CAN_MECR_SOF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MECR_Bits.SOF */
#define IFX_CAN_MECR_SOF_OFF (30u)

/** \brief Length for Ifx_CAN_MESTAT_Bits.CAPT */
#define IFX_CAN_MESTAT_CAPT_LEN (16u)

/** \brief Mask for Ifx_CAN_MESTAT_Bits.CAPT */
#define IFX_CAN_MESTAT_CAPT_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_MESTAT_Bits.CAPT */
#define IFX_CAN_MESTAT_CAPT_OFF (0u)

/** \brief Length for Ifx_CAN_MESTAT_Bits.CAPRED */
#define IFX_CAN_MESTAT_CAPRED_LEN (1u)

/** \brief Mask for Ifx_CAN_MESTAT_Bits.CAPRED */
#define IFX_CAN_MESTAT_CAPRED_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MESTAT_Bits.CAPRED */
#define IFX_CAN_MESTAT_CAPRED_OFF (16u)

/** \brief Length for Ifx_CAN_MESTAT_Bits.CAPE */
#define IFX_CAN_MESTAT_CAPE_LEN (1u)

/** \brief Mask for Ifx_CAN_MESTAT_Bits.CAPE */
#define IFX_CAN_MESTAT_CAPE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MESTAT_Bits.CAPE */
#define IFX_CAN_MESTAT_CAPE_OFF (17u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN0 */
#define IFX_CAN_ACCENCTR0_EN0_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN0 */
#define IFX_CAN_ACCENCTR0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN0 */
#define IFX_CAN_ACCENCTR0_EN0_OFF (0u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN1 */
#define IFX_CAN_ACCENCTR0_EN1_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN1 */
#define IFX_CAN_ACCENCTR0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN1 */
#define IFX_CAN_ACCENCTR0_EN1_OFF (1u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN2 */
#define IFX_CAN_ACCENCTR0_EN2_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN2 */
#define IFX_CAN_ACCENCTR0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN2 */
#define IFX_CAN_ACCENCTR0_EN2_OFF (2u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN3 */
#define IFX_CAN_ACCENCTR0_EN3_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN3 */
#define IFX_CAN_ACCENCTR0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN3 */
#define IFX_CAN_ACCENCTR0_EN3_OFF (3u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN4 */
#define IFX_CAN_ACCENCTR0_EN4_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN4 */
#define IFX_CAN_ACCENCTR0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN4 */
#define IFX_CAN_ACCENCTR0_EN4_OFF (4u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN5 */
#define IFX_CAN_ACCENCTR0_EN5_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN5 */
#define IFX_CAN_ACCENCTR0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN5 */
#define IFX_CAN_ACCENCTR0_EN5_OFF (5u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN6 */
#define IFX_CAN_ACCENCTR0_EN6_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN6 */
#define IFX_CAN_ACCENCTR0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN6 */
#define IFX_CAN_ACCENCTR0_EN6_OFF (6u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN7 */
#define IFX_CAN_ACCENCTR0_EN7_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN7 */
#define IFX_CAN_ACCENCTR0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN7 */
#define IFX_CAN_ACCENCTR0_EN7_OFF (7u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN8 */
#define IFX_CAN_ACCENCTR0_EN8_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN8 */
#define IFX_CAN_ACCENCTR0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN8 */
#define IFX_CAN_ACCENCTR0_EN8_OFF (8u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN9 */
#define IFX_CAN_ACCENCTR0_EN9_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN9 */
#define IFX_CAN_ACCENCTR0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN9 */
#define IFX_CAN_ACCENCTR0_EN9_OFF (9u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN10 */
#define IFX_CAN_ACCENCTR0_EN10_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN10 */
#define IFX_CAN_ACCENCTR0_EN10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN10 */
#define IFX_CAN_ACCENCTR0_EN10_OFF (10u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN11 */
#define IFX_CAN_ACCENCTR0_EN11_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN11 */
#define IFX_CAN_ACCENCTR0_EN11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN11 */
#define IFX_CAN_ACCENCTR0_EN11_OFF (11u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN12 */
#define IFX_CAN_ACCENCTR0_EN12_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN12 */
#define IFX_CAN_ACCENCTR0_EN12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN12 */
#define IFX_CAN_ACCENCTR0_EN12_OFF (12u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN13 */
#define IFX_CAN_ACCENCTR0_EN13_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN13 */
#define IFX_CAN_ACCENCTR0_EN13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCENCTR0_Bits.EN13 */
#define IFX_CAN_ACCENCTR0_EN13_OFF (13u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN14 */
#define IFX_CAN_ACCENCTR0_EN14_LEN (1u)

