HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TOCC_Bits.TOS */
#define IFX_CAN_N_TOCC_TOS_OFF (1u)

/** \brief Length for Ifx_CAN_N_TOCC_Bits.TOP */
#define IFX_CAN_N_TOCC_TOP_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TOCC_Bits.TOP */
#define IFX_CAN_N_TOCC_TOP_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TOCC_Bits.TOP */
#define IFX_CAN_N_TOCC_TOP_OFF (16u)

/** \brief Length for Ifx_CAN_N_TOCV_Bits.TOC */
#define IFX_CAN_N_TOCV_TOC_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TOCV_Bits.TOC */
#define IFX_CAN_N_TOCV_TOC_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TOCV_Bits.TOC */
#define IFX_CAN_N_TOCV_TOC_OFF (0u)

/** \brief Length for Ifx_CAN_N_ECR_Bits.TEC */
#define IFX_CAN_N_ECR_TEC_LEN (8u)

/** \brief Mask for Ifx_CAN_N_ECR_Bits.TEC */
#define IFX_CAN_N_ECR_TEC_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_ECR_Bits.TEC */
#define IFX_CAN_N_ECR_TEC_OFF (0u)

/** \brief Length for Ifx_CAN_N_ECR_Bits.REC */
#define IFX_CAN_N_ECR_REC_LEN (7u)

/** \brief Mask for Ifx_CAN_N_ECR_Bits.REC */
#define IFX_CAN_N_ECR_REC_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_ECR_Bits.REC */
#define IFX_CAN_N_ECR_REC_OFF (8u)

/** \brief Length for Ifx_CAN_N_ECR_Bits.RP */
#define IFX_CAN_N_ECR_RP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ECR_Bits.RP */
#define IFX_CAN_N_ECR_RP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ECR_Bits.RP */
#define IFX_CAN_N_ECR_RP_OFF (15u)

/** \brief Length for Ifx_CAN_N_ECR_Bits.CEL */
#define IFX_CAN_N_ECR_CEL_LEN (8u)

/** \brief Mask for Ifx_CAN_N_ECR_Bits.CEL */
#define IFX_CAN_N_ECR_CEL_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_ECR_Bits.CEL */
#define IFX_CAN_N_ECR_CEL_OFF (16u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.LEC */
#define IFX_CAN_N_PSR_LEC_LEN (3u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.LEC */
#define IFX_CAN_N_PSR_LEC_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.LEC */
#define IFX_CAN_N_PSR_LEC_OFF (0u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.ACT */
#define IFX_CAN_N_PSR_ACT_LEN (2u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.ACT */
#define IFX_CAN_N_PSR_ACT_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.ACT */
#define IFX_CAN_N_PSR_ACT_OFF (3u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.EP */
#define IFX_CAN_N_PSR_EP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.EP */
#define IFX_CAN_N_PSR_EP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.EP */
#define IFX_CAN_N_PSR_EP_OFF (5u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.EW */
#define IFX_CAN_N_PSR_EW_LEN (1u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.EW */
#define IFX_CAN_N_PSR_EW_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.EW */
#define IFX_CAN_N_PSR_EW_OFF (6u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.BO */
#define IFX_CAN_N_PSR_BO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.BO */
#define IFX_CAN_N_PSR_BO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.BO */
#define IFX_CAN_N_PSR_BO_OFF (7u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.DLEC */
#define IFX_CAN_N_PSR_DLEC_LEN (3u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.DLEC */
#define IFX_CAN_N_PSR_DLEC_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.DLEC */
#define IFX_CAN_N_PSR_DLEC_OFF (8u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.RESI */
#define IFX_CAN_N_PSR_RESI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.RESI */
#define IFX_CAN_N_PSR_RESI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.RESI */
#define IFX_CAN_N_PSR_RESI_OFF (11u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.RBRS */
#define IFX_CAN_N_PSR_RBRS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.RBRS */
#define IFX_CAN_N_PSR_RBRS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.RBRS */
#define IFX_CAN_N_PSR_RBRS_OFF (12u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.RFDF */
#define IFX_CAN_N_PSR_RFDF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.RFDF */
#define IFX_CAN_N_PSR_RFDF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.RFDF */
#define IFX_CAN_N_PSR_RFDF_OFF (13u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.PXE */
#define IFX_CAN_N_PSR_PXE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.PXE */
#define IFX_CAN_N_PSR_PXE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.PXE */
#define IFX_CAN_N_PSR_PXE_OFF (14u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.TDCV */
#define IFX_CAN_N_PSR_TDCV_LEN (7u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.TDCV */
#define IFX_CAN_N_PSR_TDCV_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.TDCV */
#define IFX_CAN_N_PSR_TDCV_OFF (16u)

/** \brief Length for Ifx_CAN_N_TDCR_Bits.TDCF */
#define IFX_CAN_N_TDCR_TDCF_LEN (7u)

/** \brief Mask for Ifx_CAN_N_TDCR_Bits.TDCF */
#define IFX_CAN_N_TDCR_TDCF_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_TDCR_Bits.TDCF */
#define IFX_CAN_N_TDCR_TDCF_OFF (0u)

/** \brief Length for Ifx_CAN_N_TDCR_Bits.TDCO */
#define IFX_CAN_N_TDCR_TDCO_LEN (7u)

/** \brief Mask for Ifx_CAN_N_TDCR_Bits.TDCO */
#define IFX_CAN_N_TDCR_TDCO_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_TDCR_Bits.TDCO */
#define IFX_CAN_N_TDCR_TDCO_OFF (8u)

/** \brief Length for Ifx_CAN_N_IR_Bits.RF0N */
#define IFX_CAN_N_IR_RF0N_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF0N */
#define IFX_CAN_N_IR_RF0N_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF0N */
#define IFX_CAN_N_IR_RF0N_OFF (0u)

/** \brief Length for Ifx_CAN_N_IR_Bits.RF0W */
#define IFX_CAN_N_IR_RF0W_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF0W */
#define IFX_CAN_N_IR_RF0W_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF0W */
#define IFX_CAN_N_IR_RF0W_OFF (1u)

/** \brief Length for Ifx_CAN_N_IR_Bits.RF0F */
#define IFX_CAN_N_IR_RF0F_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF0F */
#define IFX_CAN_N_IR_RF0F_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF0F */
#define IFX_CAN_N_IR_RF0F_OFF (2u)

/** \brief Length for Ifx_CAN_N_IR_Bits.RF0L */
#define IFX_CAN_N_IR_RF0L_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF0L */
#define IFX_CAN_N_IR_RF0L_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF0L */
#define IFX_CAN_N_IR_RF0L_OFF (3u)

/** \brief Length for Ifx_CAN_N_IR_Bits.RF1N */
#define IFX_CAN_N_IR_RF1N_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF1N */
#define IFX_CAN_N_IR_RF1N_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF1N */
#define IFX_CAN_N_IR_RF1N_OFF (4u)

