HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP7 */
#define IFX_CAN_N_TX_BRP_TRP7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP7 */
#define IFX_CAN_N_TX_BRP_TRP7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP7 */
#define IFX_CAN_N_TX_BRP_TRP7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP8 */
#define IFX_CAN_N_TX_BRP_TRP8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP8 */
#define IFX_CAN_N_TX_BRP_TRP8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP8 */
#define IFX_CAN_N_TX_BRP_TRP8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP9 */
#define IFX_CAN_N_TX_BRP_TRP9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP9 */
#define IFX_CAN_N_TX_BRP_TRP9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP9 */
#define IFX_CAN_N_TX_BRP_TRP9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP10 */
#define IFX_CAN_N_TX_BRP_TRP10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP10 */
#define IFX_CAN_N_TX_BRP_TRP10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP10 */
#define IFX_CAN_N_TX_BRP_TRP10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP11 */
#define IFX_CAN_N_TX_BRP_TRP11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP11 */
#define IFX_CAN_N_TX_BRP_TRP11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP11 */
#define IFX_CAN_N_TX_BRP_TRP11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP12 */
#define IFX_CAN_N_TX_BRP_TRP12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP12 */
#define IFX_CAN_N_TX_BRP_TRP12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP12 */
#define IFX_CAN_N_TX_BRP_TRP12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP13 */
#define IFX_CAN_N_TX_BRP_TRP13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP13 */
#define IFX_CAN_N_TX_BRP_TRP13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP13 */
#define IFX_CAN_N_TX_BRP_TRP13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP14 */
#define IFX_CAN_N_TX_BRP_TRP14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP14 */
#define IFX_CAN_N_TX_BRP_TRP14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP14 */
#define IFX_CAN_N_TX_BRP_TRP14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP15 */
#define IFX_CAN_N_TX_BRP_TRP15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP15 */
#define IFX_CAN_N_TX_BRP_TRP15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP15 */
#define IFX_CAN_N_TX_BRP_TRP15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP16 */
#define IFX_CAN_N_TX_BRP_TRP16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP16 */
#define IFX_CAN_N_TX_BRP_TRP16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP16 */
#define IFX_CAN_N_TX_BRP_TRP16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP17 */
#define IFX_CAN_N_TX_BRP_TRP17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP17 */
#define IFX_CAN_N_TX_BRP_TRP17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP17 */
#define IFX_CAN_N_TX_BRP_TRP17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP18 */
#define IFX_CAN_N_TX_BRP_TRP18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP18 */
#define IFX_CAN_N_TX_BRP_TRP18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP18 */
#define IFX_CAN_N_TX_BRP_TRP18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP19 */
#define IFX_CAN_N_TX_BRP_TRP19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP19 */
#define IFX_CAN_N_TX_BRP_TRP19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP19 */
#define IFX_CAN_N_TX_BRP_TRP19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP20 */
#define IFX_CAN_N_TX_BRP_TRP20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP20 */
#define IFX_CAN_N_TX_BRP_TRP20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP20 */
#define IFX_CAN_N_TX_BRP_TRP20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP21 */
#define IFX_CAN_N_TX_BRP_TRP21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP21 */
#define IFX_CAN_N_TX_BRP_TRP21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP21 */
#define IFX_CAN_N_TX_BRP_TRP21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP22 */
#define IFX_CAN_N_TX_BRP_TRP22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP22 */
#define IFX_CAN_N_TX_BRP_TRP22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP22 */
#define IFX_CAN_N_TX_BRP_TRP22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP23 */
#define IFX_CAN_N_TX_BRP_TRP23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP23 */
#define IFX_CAN_N_TX_BRP_TRP23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP23 */
#define IFX_CAN_N_TX_BRP_TRP23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP24 */
#define IFX_CAN_N_TX_BRP_TRP24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP24 */
#define IFX_CAN_N_TX_BRP_TRP24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP24 */
#define IFX_CAN_N_TX_BRP_TRP24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP25 */
#define IFX_CAN_N_TX_BRP_TRP25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP25 */
#define IFX_CAN_N_TX_BRP_TRP25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP25 */
#define IFX_CAN_N_TX_BRP_TRP25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP26 */
#define IFX_CAN_N_TX_BRP_TRP26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP26 */
#define IFX_CAN_N_TX_BRP_TRP26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP26 */
#define IFX_CAN_N_TX_BRP_TRP26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP27 */
#define IFX_CAN_N_TX_BRP_TRP27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP27 */
#define IFX_CAN_N_TX_BRP_TRP27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP27 */
#define IFX_CAN_N_TX_BRP_TRP27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP28 */
#define IFX_CAN_N_TX_BRP_TRP28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP28 */
#define IFX_CAN_N_TX_BRP_TRP28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP28 */
#define IFX_CAN_N_TX_BRP_TRP28_OFF (28u)

