HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR19 */
#define IFX_CAN_N_TX_BAR_AR19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR19 */
#define IFX_CAN_N_TX_BAR_AR19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR19 */
#define IFX_CAN_N_TX_BAR_AR19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR20 */
#define IFX_CAN_N_TX_BAR_AR20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR20 */
#define IFX_CAN_N_TX_BAR_AR20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR20 */
#define IFX_CAN_N_TX_BAR_AR20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR21 */
#define IFX_CAN_N_TX_BAR_AR21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR21 */
#define IFX_CAN_N_TX_BAR_AR21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR21 */
#define IFX_CAN_N_TX_BAR_AR21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR22 */
#define IFX_CAN_N_TX_BAR_AR22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR22 */
#define IFX_CAN_N_TX_BAR_AR22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR22 */
#define IFX_CAN_N_TX_BAR_AR22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR23 */
#define IFX_CAN_N_TX_BAR_AR23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR23 */
#define IFX_CAN_N_TX_BAR_AR23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR23 */
#define IFX_CAN_N_TX_BAR_AR23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR24 */
#define IFX_CAN_N_TX_BAR_AR24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR24 */
#define IFX_CAN_N_TX_BAR_AR24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR24 */
#define IFX_CAN_N_TX_BAR_AR24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR25 */
#define IFX_CAN_N_TX_BAR_AR25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR25 */
#define IFX_CAN_N_TX_BAR_AR25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR25 */
#define IFX_CAN_N_TX_BAR_AR25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR26 */
#define IFX_CAN_N_TX_BAR_AR26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR26 */
#define IFX_CAN_N_TX_BAR_AR26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR26 */
#define IFX_CAN_N_TX_BAR_AR26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR27 */
#define IFX_CAN_N_TX_BAR_AR27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR27 */
#define IFX_CAN_N_TX_BAR_AR27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR27 */
#define IFX_CAN_N_TX_BAR_AR27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR28 */
#define IFX_CAN_N_TX_BAR_AR28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR28 */
#define IFX_CAN_N_TX_BAR_AR28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR28 */
#define IFX_CAN_N_TX_BAR_AR28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR29 */
#define IFX_CAN_N_TX_BAR_AR29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR29 */
#define IFX_CAN_N_TX_BAR_AR29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR29 */
#define IFX_CAN_N_TX_BAR_AR29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR30 */
#define IFX_CAN_N_TX_BAR_AR30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR30 */
#define IFX_CAN_N_TX_BAR_AR30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR30 */
#define IFX_CAN_N_TX_BAR_AR30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR31 */
#define IFX_CAN_N_TX_BAR_AR31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR31 */
#define IFX_CAN_N_TX_BAR_AR31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR31 */
#define IFX_CAN_N_TX_BAR_AR31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR0 */
#define IFX_CAN_N_TX_BCR_CR0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR0 */
#define IFX_CAN_N_TX_BCR_CR0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR0 */
#define IFX_CAN_N_TX_BCR_CR0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR1 */
#define IFX_CAN_N_TX_BCR_CR1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR1 */
#define IFX_CAN_N_TX_BCR_CR1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR1 */
#define IFX_CAN_N_TX_BCR_CR1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR2 */
#define IFX_CAN_N_TX_BCR_CR2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR2 */
#define IFX_CAN_N_TX_BCR_CR2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR2 */
#define IFX_CAN_N_TX_BCR_CR2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR3 */
#define IFX_CAN_N_TX_BCR_CR3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR3 */
#define IFX_CAN_N_TX_BCR_CR3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR3 */
#define IFX_CAN_N_TX_BCR_CR3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR4 */
#define IFX_CAN_N_TX_BCR_CR4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR4 */
#define IFX_CAN_N_TX_BCR_CR4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR4 */
#define IFX_CAN_N_TX_BCR_CR4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR5 */
#define IFX_CAN_N_TX_BCR_CR5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR5 */
#define IFX_CAN_N_TX_BCR_CR5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR5 */
#define IFX_CAN_N_TX_BCR_CR5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR6 */
#define IFX_CAN_N_TX_BCR_CR6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR6 */
#define IFX_CAN_N_TX_BCR_CR6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR6 */
#define IFX_CAN_N_TX_BCR_CR6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR7 */
#define IFX_CAN_N_TX_BCR_CR7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR7 */
#define IFX_CAN_N_TX_BCR_CR7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR7 */
#define IFX_CAN_N_TX_BCR_CR7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR8 */
#define IFX_CAN_N_TX_BCR_CR8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR8 */
#define IFX_CAN_N_TX_BCR_CR8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR8 */
#define IFX_CAN_N_TX_BCR_CR8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR9 */
#define IFX_CAN_N_TX_BCR_CR9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR9 */
#define IFX_CAN_N_TX_BCR_CR9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR9 */
#define IFX_CAN_N_TX_BCR_CR9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR10 */
#define IFX_CAN_N_TX_BCR_CR10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR10 */
#define IFX_CAN_N_TX_BCR_CR10_MSK (0x1u)

