HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO24 */
#define IFX_CAN_N_TX_BTO_TO24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO25 */
#define IFX_CAN_N_TX_BTO_TO25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO25 */
#define IFX_CAN_N_TX_BTO_TO25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO25 */
#define IFX_CAN_N_TX_BTO_TO25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO26 */
#define IFX_CAN_N_TX_BTO_TO26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO26 */
#define IFX_CAN_N_TX_BTO_TO26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO26 */
#define IFX_CAN_N_TX_BTO_TO26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO27 */
#define IFX_CAN_N_TX_BTO_TO27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO27 */
#define IFX_CAN_N_TX_BTO_TO27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO27 */
#define IFX_CAN_N_TX_BTO_TO27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO28 */
#define IFX_CAN_N_TX_BTO_TO28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO28 */
#define IFX_CAN_N_TX_BTO_TO28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO28 */
#define IFX_CAN_N_TX_BTO_TO28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO29 */
#define IFX_CAN_N_TX_BTO_TO29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO29 */
#define IFX_CAN_N_TX_BTO_TO29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO29 */
#define IFX_CAN_N_TX_BTO_TO29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO30 */
#define IFX_CAN_N_TX_BTO_TO30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO30 */
#define IFX_CAN_N_TX_BTO_TO30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO30 */
#define IFX_CAN_N_TX_BTO_TO30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO31 */
#define IFX_CAN_N_TX_BTO_TO31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO31 */
#define IFX_CAN_N_TX_BTO_TO31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO31 */
#define IFX_CAN_N_TX_BTO_TO31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF0 */
#define IFX_CAN_N_TX_BCF_CF0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF0 */
#define IFX_CAN_N_TX_BCF_CF0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF0 */
#define IFX_CAN_N_TX_BCF_CF0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF1 */
#define IFX_CAN_N_TX_BCF_CF1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF1 */
#define IFX_CAN_N_TX_BCF_CF1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF1 */
#define IFX_CAN_N_TX_BCF_CF1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF2 */
#define IFX_CAN_N_TX_BCF_CF2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF2 */
#define IFX_CAN_N_TX_BCF_CF2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF2 */
#define IFX_CAN_N_TX_BCF_CF2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF3 */
#define IFX_CAN_N_TX_BCF_CF3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF3 */
#define IFX_CAN_N_TX_BCF_CF3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF3 */
#define IFX_CAN_N_TX_BCF_CF3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF4 */
#define IFX_CAN_N_TX_BCF_CF4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF4 */
#define IFX_CAN_N_TX_BCF_CF4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF4 */
#define IFX_CAN_N_TX_BCF_CF4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF5 */
#define IFX_CAN_N_TX_BCF_CF5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF5 */
#define IFX_CAN_N_TX_BCF_CF5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF5 */
#define IFX_CAN_N_TX_BCF_CF5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF6 */
#define IFX_CAN_N_TX_BCF_CF6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF6 */
#define IFX_CAN_N_TX_BCF_CF6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF6 */
#define IFX_CAN_N_TX_BCF_CF6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF7 */
#define IFX_CAN_N_TX_BCF_CF7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF7 */
#define IFX_CAN_N_TX_BCF_CF7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF7 */
#define IFX_CAN_N_TX_BCF_CF7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF8 */
#define IFX_CAN_N_TX_BCF_CF8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF8 */
#define IFX_CAN_N_TX_BCF_CF8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF8 */
#define IFX_CAN_N_TX_BCF_CF8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF9 */
#define IFX_CAN_N_TX_BCF_CF9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF9 */
#define IFX_CAN_N_TX_BCF_CF9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF9 */
#define IFX_CAN_N_TX_BCF_CF9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF10 */
#define IFX_CAN_N_TX_BCF_CF10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF10 */
#define IFX_CAN_N_TX_BCF_CF10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF10 */
#define IFX_CAN_N_TX_BCF_CF10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF11 */
#define IFX_CAN_N_TX_BCF_CF11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF11 */
#define IFX_CAN_N_TX_BCF_CF11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF11 */
#define IFX_CAN_N_TX_BCF_CF11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF12 */
#define IFX_CAN_N_TX_BCF_CF12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF12 */
#define IFX_CAN_N_TX_BCF_CF12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF12 */
#define IFX_CAN_N_TX_BCF_CF12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF13 */
#define IFX_CAN_N_TX_BCF_CF13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF13 */
#define IFX_CAN_N_TX_BCF_CF13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF13 */
#define IFX_CAN_N_TX_BCF_CF13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF14 */
#define IFX_CAN_N_TX_BCF_CF14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF14 */
#define IFX_CAN_N_TX_BCF_CF14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF14 */
#define IFX_CAN_N_TX_BCF_CF14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF15 */
#define IFX_CAN_N_TX_BCF_CF15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF15 */
#define IFX_CAN_N_TX_BCF_CF15_MSK (0x1u)

