HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE28 */
#define IFX_CAN_N_TX_BTIE_TIE28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE28 */
#define IFX_CAN_N_TX_BTIE_TIE28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE28 */
#define IFX_CAN_N_TX_BTIE_TIE28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE29 */
#define IFX_CAN_N_TX_BTIE_TIE29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE29 */
#define IFX_CAN_N_TX_BTIE_TIE29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE29 */
#define IFX_CAN_N_TX_BTIE_TIE29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE30 */
#define IFX_CAN_N_TX_BTIE_TIE30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE30 */
#define IFX_CAN_N_TX_BTIE_TIE30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE30 */
#define IFX_CAN_N_TX_BTIE_TIE30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE31 */
#define IFX_CAN_N_TX_BTIE_TIE31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE31 */
#define IFX_CAN_N_TX_BTIE_TIE31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE31 */
#define IFX_CAN_N_TX_BTIE_TIE31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE0 */
#define IFX_CAN_N_TX_BCIE_CFIE0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE0 */
#define IFX_CAN_N_TX_BCIE_CFIE0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE0 */
#define IFX_CAN_N_TX_BCIE_CFIE0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE1 */
#define IFX_CAN_N_TX_BCIE_CFIE1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE1 */
#define IFX_CAN_N_TX_BCIE_CFIE1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE1 */
#define IFX_CAN_N_TX_BCIE_CFIE1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE2 */
#define IFX_CAN_N_TX_BCIE_CFIE2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE2 */
#define IFX_CAN_N_TX_BCIE_CFIE2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE2 */
#define IFX_CAN_N_TX_BCIE_CFIE2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE3 */
#define IFX_CAN_N_TX_BCIE_CFIE3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE3 */
#define IFX_CAN_N_TX_BCIE_CFIE3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE3 */
#define IFX_CAN_N_TX_BCIE_CFIE3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE4 */
#define IFX_CAN_N_TX_BCIE_CFIE4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE4 */
#define IFX_CAN_N_TX_BCIE_CFIE4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE4 */
#define IFX_CAN_N_TX_BCIE_CFIE4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE5 */
#define IFX_CAN_N_TX_BCIE_CFIE5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE5 */
#define IFX_CAN_N_TX_BCIE_CFIE5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE5 */
#define IFX_CAN_N_TX_BCIE_CFIE5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE6 */
#define IFX_CAN_N_TX_BCIE_CFIE6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE6 */
#define IFX_CAN_N_TX_BCIE_CFIE6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE6 */
#define IFX_CAN_N_TX_BCIE_CFIE6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE7 */
#define IFX_CAN_N_TX_BCIE_CFIE7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE7 */
#define IFX_CAN_N_TX_BCIE_CFIE7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE7 */
#define IFX_CAN_N_TX_BCIE_CFIE7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE8 */
#define IFX_CAN_N_TX_BCIE_CFIE8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE8 */
#define IFX_CAN_N_TX_BCIE_CFIE8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE8 */
#define IFX_CAN_N_TX_BCIE_CFIE8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE9 */
#define IFX_CAN_N_TX_BCIE_CFIE9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE9 */
#define IFX_CAN_N_TX_BCIE_CFIE9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE9 */
#define IFX_CAN_N_TX_BCIE_CFIE9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE10 */
#define IFX_CAN_N_TX_BCIE_CFIE10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE10 */
#define IFX_CAN_N_TX_BCIE_CFIE10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE10 */
#define IFX_CAN_N_TX_BCIE_CFIE10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE11 */
#define IFX_CAN_N_TX_BCIE_CFIE11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE11 */
#define IFX_CAN_N_TX_BCIE_CFIE11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE11 */
#define IFX_CAN_N_TX_BCIE_CFIE11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE12 */
#define IFX_CAN_N_TX_BCIE_CFIE12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE12 */
#define IFX_CAN_N_TX_BCIE_CFIE12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE12 */
#define IFX_CAN_N_TX_BCIE_CFIE12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE13 */
#define IFX_CAN_N_TX_BCIE_CFIE13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE13 */
#define IFX_CAN_N_TX_BCIE_CFIE13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE13 */
#define IFX_CAN_N_TX_BCIE_CFIE13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE14 */
#define IFX_CAN_N_TX_BCIE_CFIE14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE14 */
#define IFX_CAN_N_TX_BCIE_CFIE14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE14 */
#define IFX_CAN_N_TX_BCIE_CFIE14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE15 */
#define IFX_CAN_N_TX_BCIE_CFIE15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE15 */
#define IFX_CAN_N_TX_BCIE_CFIE15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE15 */
#define IFX_CAN_N_TX_BCIE_CFIE15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE16 */
#define IFX_CAN_N_TX_BCIE_CFIE16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE16 */
#define IFX_CAN_N_TX_BCIE_CFIE16_MSK (0x1u)

