HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TT_OST_Bits.WFE */
#define IFX_CAN_N_TT_OST_WFE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.WFE */
#define IFX_CAN_N_TT_OST_WFE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.WFE */
#define IFX_CAN_N_TT_OST_WFE_OFF (28u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.AWE */
#define IFX_CAN_N_TT_OST_AWE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.AWE */
#define IFX_CAN_N_TT_OST_AWE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.AWE */
#define IFX_CAN_N_TT_OST_AWE_OFF (29u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.WECS */
#define IFX_CAN_N_TT_OST_WECS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.WECS */
#define IFX_CAN_N_TT_OST_WECS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.WECS */
#define IFX_CAN_N_TT_OST_WECS_OFF (30u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.SPL */
#define IFX_CAN_N_TT_OST_SPL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.SPL */
#define IFX_CAN_N_TT_OST_SPL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.SPL */
#define IFX_CAN_N_TT_OST_SPL_OFF (31u)

/** \brief Length for Ifx_CAN_N_TT_TURNA_Bits.NAV */
#define IFX_CAN_N_TT_TURNA_NAV_LEN (18u)

/** \brief Mask for Ifx_CAN_N_TT_TURNA_Bits.NAV */
#define IFX_CAN_N_TT_TURNA_NAV_MSK (0x3ffffu)

/** \brief Offset for Ifx_CAN_N_TT_TURNA_Bits.NAV */
#define IFX_CAN_N_TT_TURNA_NAV_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_LGT_Bits.LT */
#define IFX_CAN_N_TT_LGT_LT_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_LGT_Bits.LT */
#define IFX_CAN_N_TT_LGT_LT_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_LGT_Bits.LT */
#define IFX_CAN_N_TT_LGT_LT_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_LGT_Bits.GT */
#define IFX_CAN_N_TT_LGT_GT_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_LGT_Bits.GT */
#define IFX_CAN_N_TT_LGT_GT_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_LGT_Bits.GT */
#define IFX_CAN_N_TT_LGT_GT_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_CTC_Bits.CT */
#define IFX_CAN_N_TT_CTC_CT_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_CTC_Bits.CT */
#define IFX_CAN_N_TT_CTC_CT_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_CTC_Bits.CT */
#define IFX_CAN_N_TT_CTC_CT_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_CTC_Bits.CC */
#define IFX_CAN_N_TT_CTC_CC_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TT_CTC_Bits.CC */
#define IFX_CAN_N_TT_CTC_CC_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TT_CTC_Bits.CC */
#define IFX_CAN_N_TT_CTC_CC_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_CPT_Bits.CCV */
#define IFX_CAN_N_TT_CPT_CCV_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TT_CPT_Bits.CCV */
#define IFX_CAN_N_TT_CPT_CCV_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TT_CPT_Bits.CCV */
#define IFX_CAN_N_TT_CPT_CCV_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_CPT_Bits.SWV */
#define IFX_CAN_N_TT_CPT_SWV_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_CPT_Bits.SWV */
#define IFX_CAN_N_TT_CPT_SWV_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_CPT_Bits.SWV */
#define IFX_CAN_N_TT_CPT_SWV_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_CSM_Bits.CSM */
#define IFX_CAN_N_TT_CSM_CSM_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_CSM_Bits.CSM */
#define IFX_CAN_N_TT_CSM_CSM_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_CSM_Bits.CSM */
#define IFX_CAN_N_TT_CSM_CSM_OFF (0u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFID2 */
#define IFX_CAN_STDMSG_S0_SFID2_LEN (11u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFID2 */
#define IFX_CAN_STDMSG_S0_SFID2_MSK (0x7ffu)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFID2 */
#define IFX_CAN_STDMSG_S0_SFID2_OFF (0u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFID1 */
#define IFX_CAN_STDMSG_S0_SFID1_LEN (11u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFID1 */
#define IFX_CAN_STDMSG_S0_SFID1_MSK (0x7ffu)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFID1 */
#define IFX_CAN_STDMSG_S0_SFID1_OFF (16u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFEC */
#define IFX_CAN_STDMSG_S0_SFEC_LEN (3u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFEC */
#define IFX_CAN_STDMSG_S0_SFEC_MSK (0x7u)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFEC */
#define IFX_CAN_STDMSG_S0_SFEC_OFF (27u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFT */
#define IFX_CAN_STDMSG_S0_SFT_LEN (2u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFT */
#define IFX_CAN_STDMSG_S0_SFT_MSK (0x3u)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFT */
#define IFX_CAN_STDMSG_S0_SFT_OFF (30u)

/** \brief Length for Ifx_CAN_EXTMSG_F0_Bits.EFID1 */
#define IFX_CAN_EXTMSG_F0_EFID1_LEN (29u)

/** \brief Mask for Ifx_CAN_EXTMSG_F0_Bits.EFID1 */
#define IFX_CAN_EXTMSG_F0_EFID1_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_EXTMSG_F0_Bits.EFID1 */
#define IFX_CAN_EXTMSG_F0_EFID1_OFF (0u)

/** \brief Length for Ifx_CAN_EXTMSG_F0_Bits.EFEC */
#define IFX_CAN_EXTMSG_F0_EFEC_LEN (3u)

/** \brief Mask for Ifx_CAN_EXTMSG_F0_Bits.EFEC */
#define IFX_CAN_EXTMSG_F0_EFEC_MSK (0x7u)

/** \brief Offset for Ifx_CAN_EXTMSG_F0_Bits.EFEC */
#define IFX_CAN_EXTMSG_F0_EFEC_OFF (29u)

/** \brief Length for Ifx_CAN_EXTMSG_F1_Bits.EFID2 */
#define IFX_CAN_EXTMSG_F1_EFID2_LEN (29u)

/** \brief Mask for Ifx_CAN_EXTMSG_F1_Bits.EFID2 */
#define IFX_CAN_EXTMSG_F1_EFID2_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_EXTMSG_F1_Bits.EFID2 */
#define IFX_CAN_EXTMSG_F1_EFID2_OFF (0u)

/** \brief Length for Ifx_CAN_EXTMSG_F1_Bits.EFT */
#define IFX_CAN_EXTMSG_F1_EFT_LEN (2u)

/** \brief Mask for Ifx_CAN_EXTMSG_F1_Bits.EFT */
#define IFX_CAN_EXTMSG_F1_EFT_MSK (0x3u)

/** \brief Offset for Ifx_CAN_EXTMSG_F1_Bits.EFT */
#define IFX_CAN_EXTMSG_F1_EFT_OFF (30u)

/** \brief Length for Ifx_CAN_R0_Bits.ID */
#define IFX_CAN_R0_ID_LEN (29u)

/** \brief Mask for Ifx_CAN_R0_Bits.ID */
#define IFX_CAN_R0_ID_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_R0_Bits.ID */
#define IFX_CAN_R0_ID_OFF (0u)

/** \brief Length for Ifx_CAN_R0_Bits.RTR */
#define IFX_CAN_R0_RTR_LEN (1u)

/** \brief Mask for Ifx_CAN_R0_Bits.RTR */
#define IFX_CAN_R0_RTR_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R0_Bits.RTR */
#define IFX_CAN_R0_RTR_OFF (29u)

