HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_TXMSG_T1_Bits.BRS */
#define IFX_CAN_TXMSG_T1_BRS_LEN (1u)

/** \brief Mask for Ifx_CAN_TXMSG_T1_Bits.BRS */
#define IFX_CAN_TXMSG_T1_BRS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXMSG_T1_Bits.BRS */
#define IFX_CAN_TXMSG_T1_BRS_OFF (20u)

/** \brief Length for Ifx_CAN_TXMSG_T1_Bits.FDF */
#define IFX_CAN_TXMSG_T1_FDF_LEN (1u)

/** \brief Mask for Ifx_CAN_TXMSG_T1_Bits.FDF */
#define IFX_CAN_TXMSG_T1_FDF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXMSG_T1_Bits.FDF */
#define IFX_CAN_TXMSG_T1_FDF_OFF (21u)

/** \brief Length for Ifx_CAN_TXMSG_T1_Bits.EFC */
#define IFX_CAN_TXMSG_T1_EFC_LEN (1u)

/** \brief Mask for Ifx_CAN_TXMSG_T1_Bits.EFC */
#define IFX_CAN_TXMSG_T1_EFC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXMSG_T1_Bits.EFC */
#define IFX_CAN_TXMSG_T1_EFC_OFF (23u)

/** \brief Length for Ifx_CAN_TXMSG_T1_Bits.MM */
#define IFX_CAN_TXMSG_T1_MM_LEN (8u)

/** \brief Mask for Ifx_CAN_TXMSG_T1_Bits.MM */
#define IFX_CAN_TXMSG_T1_MM_MSK (0xffu)

/** \brief Offset for Ifx_CAN_TXMSG_T1_Bits.MM */
#define IFX_CAN_TXMSG_T1_MM_OFF (24u)

/** \brief Length for Ifx_CAN_TXMSG_DB_Bits.DB */
#define IFX_CAN_TXMSG_DB_DB_LEN (8u)

/** \brief Mask for Ifx_CAN_TXMSG_DB_Bits.DB */
#define IFX_CAN_TXMSG_DB_DB_MSK (0xffu)

/** \brief Offset for Ifx_CAN_TXMSG_DB_Bits.DB */
#define IFX_CAN_TXMSG_DB_DB_OFF (0u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.TYPE */
#define IFX_CAN_TRIGMSG_TM0_TYPE_LEN (4u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.TYPE */
#define IFX_CAN_TRIGMSG_TM0_TYPE_MSK (0xfu)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.TYPE */
#define IFX_CAN_TRIGMSG_TM0_TYPE_OFF (0u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.TMEX */
#define IFX_CAN_TRIGMSG_TM0_TMEX_LEN (1u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.TMEX */
#define IFX_CAN_TRIGMSG_TM0_TMEX_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.TMEX */
#define IFX_CAN_TRIGMSG_TM0_TMEX_OFF (4u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.TMIN */
#define IFX_CAN_TRIGMSG_TM0_TMIN_LEN (1u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.TMIN */
#define IFX_CAN_TRIGMSG_TM0_TMIN_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.TMIN */
#define IFX_CAN_TRIGMSG_TM0_TMIN_OFF (5u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.CC */
#define IFX_CAN_TRIGMSG_TM0_CC_LEN (7u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.CC */
#define IFX_CAN_TRIGMSG_TM0_CC_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.CC */
#define IFX_CAN_TRIGMSG_TM0_CC_OFF (8u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.TM */
#define IFX_CAN_TRIGMSG_TM0_TM_LEN (16u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.TM */
#define IFX_CAN_TRIGMSG_TM0_TM_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.TM */
#define IFX_CAN_TRIGMSG_TM0_TM_OFF (16u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM1_Bits.MSC */
#define IFX_CAN_TRIGMSG_TM1_MSC_LEN (3u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM1_Bits.MSC */
#define IFX_CAN_TRIGMSG_TM1_MSC_MSK (0x7u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM1_Bits.MSC */
#define IFX_CAN_TRIGMSG_TM1_MSC_OFF (0u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM1_Bits.MMR */
#define IFX_CAN_TRIGMSG_TM1_MMR_LEN (7u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM1_Bits.MMR */
#define IFX_CAN_TRIGMSG_TM1_MMR_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM1_Bits.MMR */
#define IFX_CAN_TRIGMSG_TM1_MMR_OFF (16u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM1_Bits.FTYPE */
#define IFX_CAN_TRIGMSG_TM1_FTYPE_LEN (1u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM1_Bits.FTYPE */
#define IFX_CAN_TRIGMSG_TM1_FTYPE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM1_Bits.FTYPE */
#define IFX_CAN_TRIGMSG_TM1_FTYPE_OFF (23u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXCAN_BF_H */
